org/main/20211114120802-vim.org
:PROPERTIES:
:ID:       8850FE15-E0E8-41FB-B0E5-C697D0F00AD8
:END:
#+title: vim
#+HUGO_SECTION:main
* Modes
** Command mode
enter from insert mode and command line mode with ~ESC~
** Insert mode
enter from command mode with ~o,a,i,R~
+ Meanings
  + o,O: cusor at next line/up line
  + i,I: cusor at point/first in line
  + a,A: cursor at next point/last in line
  + r,R: replace mode. r replace for once, R replace until hit ESC
** Command line mode
enter from command mode with ~:,/,?~
* Commands

** Batch
Add ~n~ argument in front of command

** Cursor movement
*** Charactor
~h,j,k,l~ for left, down, up, right 
*** page
~C-f~ a page down(forward)
~C-b~ a page up(back)
~C-d~ half page down
~C-u~ half page up
*** lines
~+~ non-empty down line
~-~ non-empty up line
~n<enter>~ n lines down
*** in line
~n<space>~ n characters right
~0~ ~$~ start, end
*** on screen
~H,M,L~ Highest, middel, lowest line's first charactor
*** Line jump
~1G,gg~ first file in file
~G~ last line in file
~nG~ nth line in file
** Find & replace
*** Find
~/word,?word~ search for word down/up the cursor
~n,N~ search for the last searched word down/up
*** Replace
~:n1,n2s/word1/word2/g~ find & replace word1 with word2 between line n1 and n2
~:1,$s/word1/word2/g~ find&replace between whole file
~:1,$s/word1/word2/gc~ add confirm for every entry
** Delete, Copy, Paste
*** Delete
~x,X~ delete next/back a charactor
~dd~ delete whole line at cursor
~d1G,dG~ delete everything between cursor and first/last line
~d0,$~ delete everything between cursor and the first/last charactor in line
~c~ repeat delete. e.g: delete down 10 lines: [10cj]
*** Copy
~yy~ copy line at cursor
~nyy~ copy n lines down cursor
~y1G,yG,y0,y$~ copy regions from cursor to top, buttom, startofline, endofline
*** Paste
~p,P~ paste the copied content after/before the line at cursor
*** other
~J~ combine this line and next line
** undo and redo
~u~ undo
~C-r~ redo
~.~ repeat last command
** save, quit
*** save
~:w [filename]~ save as filename
~:n1,n2 [filename]~ save from line n1 to n2 as filename
*** read
~:r [filename]~ read from filename
*** switch
~:! SHELL_COMMAND~ temp leave vim to shell to see the result of SHELL_COMMAND
** Environment
~:set nu, set nonum~
** Select
~v~ select charactor cursor passing
~V~ select line passing
~C-v~ select rectangle area
~y,d~ copy, delete
** multi window
~:sp [filename]~ open another window for filname(optional)
~C-w j/k~ move cursor

